# TP NoSQL

Prénom :

Nom : 

Pour ce TP noté vous avez à trois heures pour le réaliser et 48 heures pour le finir si besoin. Le rendu final est attendu pour dimanche 29 septembre 2024 à 23 h 59.

Vous serrez évalués sur les requêtes mais également sur la qualité et la propreté du code. Pour chaque question, une réponse présentant les résultats est attendue.

In [1]:
# installation des packages pandas et pymongo
!pip install -r requirements.txt --quiet

In [2]:
import pymongo
import pandas as pd

URI = 'mongodb+srv://mongo_user:OZsWVodwxATISvpe@cluster-but-sd.o3zbt.mongodb.net/?retryWrites=true&w=majority&appName=cluster-but-sd'
client = pymongo.MongoClient(URI)
db = client.tp

# output the name of the collections in the database
print("Collections: ", db.list_collection_names())

Collections:  ['restaurants', 'airbnb']

1. Combien de logements sont la base de données ?

In [10]:
c= db.airbnb.count_documents({})
print(c)
#il ya 5555 logements

5555

2. Quel est le prix moyen par ville ? Trier les villes par prix décroissant.

In [120]:
c = db.airbnb.aggregate([
    { "$group": { "_id": "$address.market","prix moyen": { "$avg": "$price" }}},
    { "$sort": { "average_price": -1 }}
])

q2 = pd.DataFrame(list(c))
print(q2)

                      _id                           prix moyen
0               Hong Kong  762.4781906300484652665589660743134
1                Montreal  100.2330246913580246913580246913580
2                   Porto  69.12815884476534296028880866425993
3                    Maui  286.5882352941176470588235294117647
4          The Big Island  179.4604316546762589928057553956835
5   Other (International)                               445.75
6                Istanbul  367.9454545454545454545454545454545
7          Rio De Janeiro  525.8059701492537313432835820895522
8        Other (Domestic)                               128.00
9                New York  139.6260296540362438220757825370675
10              Barcelona  100.9477848101265822784810126582278
11                 Sydney  197.7142857142857142857142857142857
12                  Kauai  288.8208955223880597014925373134328
13                                                      115.50
14                   Oahu  212.2964426877470355731225296442688

3. Afficher la liste de tous les différents équipements qui existent.

In [144]:
 c = db.airbnb.aggregate([
    { "$unwind": "$amenities" },
    { "$group": { "_id": "$amenities" } },
    { "$project": { "équipments": "$_id", "_id": 0 } }
])

pd.DataFrame(list(c))

                    équipments
0                 Shower chair
1                   Waterfront
2                   DVD player
3         Memory foam mattress
4                Window guards
..                         ...
181                   Internet
182           Air conditioning
183  Paid parking off premises
184              Boogie boards
185        Free street parking

[186 rows x 1 columns]

4. Combien de propriétés incluent le Wifi dans les équipements ?

In [126]:
c = db.airbnb.count_documents({"amenities": "Wifi"})
print(c)

5303

5. Afficher le nom de tous les logements ainsi que le nombre de chambres et de lits qu'ils contiennent (ne pas afficher l'ID)

In [146]:
c = db.airbnb.aggregate([
       { "$group": { "_id": "$name", 
                 "nb_chambre":{"$sum": "$bedrooms"},
                 "nb_lits": { "$sum": "$beds" }}} 
])
pd.DataFrame(list(c))

                                                    _id  nb_chambre  nb_lits
0              Bright and spacious Sheung Wan apartment           1        1
1        bonita y comoda habitacion en el piso céntrico           1        1
2     Comfortable large single bedroom for female gu...           1        1
3                2 Bdrm/2 Bath  Family Suite Ocean View           2        4
4       Large attic room, ensuite bathroom Forest Lodge           1        1
...                                                 ...         ...      ...
5533                 Cuty Apartment MONTREAL-Le plateau           1        1
5534                  Aconchegante , Colorido e Lúdico.           1        2
5535            Southside 1 Bedroom in a 2 Bedroom Flat           1        1
5536                                      `LM 三個睡房的整间公寓           3        3
5537     Copacabana-Apto Conjugado-4 pessoas- Posto 2,5           1        2

[5538 rows x 3 columns]

6. Afficher le nom et le prix des logements situés à Porto.

In [130]:
c = db.airbnb.find({"address.market" : "Porto"},
            { "_id": 0, "name" : 1 ,"price": 1 }     )
data = pd.DataFrame(list(c))
print(data)

                                    name   price
0                Ribeira Charming Duplex   80.00
1                      Be Happy in Porto   30.00
2    Downtown Oporto Inn (room cleaning)   40.00
3                         FloresRooms 3T   31.00
4     A Casa Alegre é um apartamento T1.   40.00
..                                   ...     ...
549         Number283 - Your home abroad   48.00
550        Cozy apartment downtown Porto   58.00
551                   Soares Guest House   90.00
552   Central, Modern, University, Metro   41.00
553     StayIN Oporto Música - Apartment  500.00

[554 rows x 2 columns]

7. Quels sont les 5 hôtes les plus populaires (ceux dont les propriétés ont reçu le plus de commentaires) ?

In [134]:
c = db.airbnb.aggregate([ 
    { "$unwind": "$reviews" },
    { "$group": {"_id": "$_id", "review_count": {"$sum": 1}}},
     { "$sort": { "review_count": -1 }},
     { "$limit": 5 }
])
pd.DataFrame(list(c))

        _id  review_count
0   4069429           533
1  12954762           469
2     95560           463
3    476983           420
4   5283892           408

8. Quelles sont les 6 villes ayant le plus de logements disponibles à la location ?

In [138]:
c = db.airbnb.aggregate([ 
    { "$group": {"_id": "$address.market", "count": {"$sum": 1}}},
     { "$sort": {"count": -1}},
     { "$limit": 6 }
])
pd.DataFrame(list(c))

         _id  count
0   Istanbul    660
1   Montreal    648
2  Barcelona    632
3  Hong Kong    619
4     Sydney    609
5   New York    607

9. Combien de propriétés acceptent plus de 4 invités et ont une caution de moins de 300€ ?

In [142]:
c = db.airbnb.aggregate([ 
    {"$match": {"accommodates": {"$gt": 4}, "security_deposit": {"$lt": 300}}},
     {"$project": {
            "name": 1,
            "security_deposit": 1,
            "accommodates": 1,
            "room_type": 1}},
])
pd.DataFrame(list(c))

,_id,name,room_type,accommodates,security_deposit
0,10006546,Ribeira Charming Duplex,Entire home/apt,8,200.00
1,10051164,Catete's Colonial Big Hause Room B,Private room,8,0.00
2,1022200,"Kailua-Kona, Kona Coast II 2b condo",Entire home/apt,6,200.00
3,10133350,2 bedroom Upper east side,Entire home/apt,5,0.00
4,10166883,Large railroad style 3 bedroom apt in Manhattan!,Entire home/apt,9,199.00
...,...,...,...,...,...
446,9567840,Large Comfortable CBD Convenience,Entire home/apt,6,0.00
447,9990304,March Madness Special! Aina Nalu Platinum D107,Entire home/apt,6,200.00
448,9372696,Economy Family Room for 4-5pax (306),Private room,5,0.00
449,9612902,1921 15kms from Sydney CBD with Pool Spa parking.,Entire home/apt,9,0.00
450,9917859,StayIN Oporto Música - Apartment,Entire home/apt,16,200.00

10. Donner les 20 utilisateurs qui ont fait le plus de commentaires (afficher seulement l'ID et le nom de l'utilisateur).

In [148]:
c = db.airbnb.aggregate([
    {"$unwind": "$reviews"},
    {"$group" : {"_id" : "$reviews.reviewer_id", "nom" : {"$first": "$reviews.reviewer_name"}, "com" :{"$sum" :1 }}},
    {"$sort" :{ "com" : -1}},
    {"$limit" : 20}
])
pd.DataFrame(list(c))

          _id       nom  com
0    20775242    Filipe   24
1    67084875      Nick   13
2     2961855       Uge   10
3    20991911      Lisa    9
4   162027327     Thien    9
5    60816198      Todd    8
6    69140895      Lisa    8
7     1705870     David    8
8    12679057      Jodi    8
9    55241576  Courtney    8
10   78093968     David    7
11   47303133     Lance    7
12   61469899      Erik    6
13   73708321   Gonzalo    6
14   57325457      Mary    6
15   24667379     Karen    6
16   93859831    Pierre    6
17   86665925     Chris    6
18   25715809     Megan    6
19   34005800       Dan    6

11. Parmi les logements à Sydney, quel est la note moyenne des visiteurs ?

In [104]:
c = db.airbnb.aggregate([
    { "$match": { "address.market": "Sydney" }},
    {"$group":{"_id": "$address.market" ,"score": { "$avg": "$review_scores.review_scores_rating"} }}
 ])
pd.DataFrame(list(c))
#le score moyen de parmis les logements à Sydney est 93.45567
#J'ai commencé par filtrer sur Sydney

      _id     score
0  Sydney  93.45567

12. (bonus) Afficher les logements qui contiennent le mot "park" dans leur nom

13. (bonus) Afficher le nom des logements ayant une lattitude comprise entre 36,1 et 40,6 dont le prix est entre 100 et 200 euros.

In [150]:
 c= db.airbnb.aggregate([
     { "$match": { 
        "address.location.coordinates.1": { "$gte": 36.1, "$lte": 40.6 },
        "price": { "$gte": 100, "$lte": 200 }
    }},
    { "$project": { "nom_du_logement": "$name", "_id": 0,}}
    
])
pd.DataFrame(list(c))

                                  nom_du_logement
0              Cozy Comfy Suite of Rockaway Beach
1       Coney Island MCU Park Wi fi Cable Apt****
2  Sheepshead Bay, 1-bdr apartment. Close to all!